taurus/blazedemo-csv-taurus.yml
provisioning: cloud

modules:
  cloud:
    token: ${{ secrets.BLAZEMETER_API_TOKEN }}
    account: 291446
    workspace: 435725
    project: 530057
    test: BlazeDemoCSVTaurus
    timeout: 7s # BlazeMeter API client timeout.
    browser-open: none
    
scenarios:
  sample:
    script: 'blazedemo_csv.jmx'
    data-sources:
      - 'flightoptions.csv'

reporting:
- module: passfail
  criteria:
  - failures>2%, stop as failed

execution:
- scenario: sample
  executor: jmeter
  concurrency: 15
  hold-for: 1m
  ramp-up: 30s
  locations: #uncomment if you want to configure locations.
      us-east-1: 1