taurus/blazedemo-csv-taurus.yml
provisioning: cloud

modules:
  cloud:
    test: BlazeDemoCSVTaurus
    timeout: 7s # BlazeMeter API client timeout
    browser-open: start # auto-open browser on test start/end/both/none
    account: 1348473
    workspace: 1390065
    project: 1785440

scenarios:
  sample:
    script: 'blazedemo_csv.jmx'
    data-sources:
      - 'flightoptions.csv'

#reporting:
#- module: final-stats
#- module: console

execution:
- scenario: sample
  executor: jmeter
  concurrency: 15
  hold-for: 1m
  ramp-up: 30s
  #locations:
  #    us-west-1: 1