taurus/blazedemo-csv-taurus.yml
provisioning: cloud

modules:
  cloud:
    test: BlazeDemoCSVTaurus
    timeout: 7s # BlazeMeter API client timeout.
    #browser-open: start # auto-open browser on test start/end/both/none
    #account, workspace and project defined on .bzt-rc file to confirm

scenarios:
  sample:
    script: 'blazedemo_csv.jmx'
    data-sources:
      - 'flightoptions.csv'

reporting:
- module: passfail
  criteria:
  - failures>2%, stop as failed

execution:
- scenario: sample
  executor: jmeter
  concurrency: 15
  hold-for: 1m
  ramp-up: 30s
  locations: #uncomment if you want to configure locations
      us-west-1: 1