taurus/blazedemo-csv-taurus.yml
provisioning: cloud

modules:
  cloud:
    test: BlazeDemoCSVTaurus
    timeout: 7s # BlazeMeter API client timeout
    browser-open: start # auto-open browser on test start/end/both/none
    #account, workspace and project defined on .bzt-rc file

scenarios:
  sample:
    script: 'blazedemo_csv.jmx'
    data-sources:
      - 'flightoptions.csv'

reporting:
- module: passfail
  criteria:
  - failures>2%, stop as failed
#- module: final-stats
#- module: console

execution:
- scenario: sample
  executor: jmeter
  concurrency: 15
  hold-for: 1m
  ramp-up: 30s
  #locations:
  #    us-west-1: 1