taurus/blazedemo-csv-taurus.yml
provisioning: cloud

modules:
  cloud:
    test: BlazeDemoCSVTaurus
    timeout: 7s # BlazeMeter API client timeout
    browser-open: start # auto-open browser on test start/end/both/none
    #account, workspace and project defined on .bzt-rc file

scenarios:
  sample:
    script: 'blazedemo_csv.jmx'
    data-sources:
      - 'flightoptions.csv'

#reporting:
#- module: final-stats
#- module: console
reporting:
  - module: passfail
    criteria:
      - critical:
          failed_ratio: 0.02

execution:
- scenario: sample
  executor: jmeter
  concurrency: 15
  hold-for: 1m
  ramp-up: 30s
  #locations:
  #    us-west-1: 1